SqueezeSeg(
  (conv1): Conv(
    (conv): Conv2d(3, 64, kernel_size=(3, 3), stride=(1, 2), padding=(1, 1))
  )
  (conv1_skip): Conv(
    (conv): Conv2d(3, 64, kernel_size=(1, 1), stride=(1, 1))
  )
  (pool1): MaxPool2d(kernel_size=3, stride=(1, 2), padding=(1, 0), dilation=1, ceil_mode=True)
  (fire2): Fire(
    (layer_1): Conv(
      (conv): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(16, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire3): Fire(
    (layer_1): Conv(
      (conv): Conv2d(128, 16, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(16, 64, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(16, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (pool3): MaxPool2d(kernel_size=3, stride=(1, 2), padding=(1, 0), dilation=1, ceil_mode=True)
  (fire4): Fire(
    (layer_1): Conv(
      (conv): Conv2d(128, 32, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(32, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire5): Fire(
    (layer_1): Conv(
      (conv): Conv2d(256, 32, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(32, 128, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(32, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (pool5): MaxPool2d(kernel_size=3, stride=(1, 2), padding=(1, 0), dilation=1, ceil_mode=True)
  (fire6): Fire(
    (layer_1): Conv(
      (conv): Conv2d(256, 48, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(48, 192, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(48, 192, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire7): Fire(
    (layer_1): Conv(
      (conv): Conv2d(384, 48, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(48, 192, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(48, 192, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire8): Fire(
    (layer_1): Conv(
      (conv): Conv2d(384, 64, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(64, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire9): Fire(
    (layer_1): Conv(
      (conv): Conv2d(512, 64, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_a): Conv(
      (conv): Conv2d(64, 256, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(64, 256, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire10): FireDeconv(
    (layer_1): Conv(
      (conv): Conv2d(512, 64, kernel_size=(1, 1), stride=(1, 1))
    )
    (deconv): Deconv(
      (deconv): ConvTranspose2d(64, 64, kernel_size=[1, 4], stride=[1, 2], padding=[0, 1])
    )
    (layer_2_a): Conv(
      (conv): Conv2d(64, 128, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(64, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire11): FireDeconv(
    (layer_1): Conv(
      (conv): Conv2d(256, 32, kernel_size=(1, 1), stride=(1, 1))
    )
    (deconv): Deconv(
      (deconv): ConvTranspose2d(32, 32, kernel_size=[1, 4], stride=[1, 2], padding=[0, 1])
    )
    (layer_2_a): Conv(
      (conv): Conv2d(32, 64, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(32, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire12): FireDeconv(
    (layer_1): Conv(
      (conv): Conv2d(128, 16, kernel_size=(1, 1), stride=(1, 1))
    )
    (deconv): Deconv(
      (deconv): ConvTranspose2d(16, 16, kernel_size=[1, 4], stride=[1, 2], padding=[0, 1])
    )
    (layer_2_a): Conv(
      (conv): Conv2d(16, 32, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(16, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (fire13): FireDeconv(
    (layer_1): Conv(
      (conv): Conv2d(64, 16, kernel_size=(1, 1), stride=(1, 1))
    )
    (deconv): Deconv(
      (deconv): ConvTranspose2d(16, 16, kernel_size=[1, 4], stride=[1, 2], padding=[0, 1])
    )
    (layer_2_a): Conv(
      (conv): Conv2d(16, 32, kernel_size=(1, 1), stride=(1, 1))
    )
    (layer_2_b): Conv(
      (conv): Conv2d(16, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    )
  )
  (drop): Dropout2d(p=0.5, inplace=False)
  (conv14): Conv2d(64, 4, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
)